import React from 'react';
import { Grid } from '@mui/material';
import SubTopicAccordion from './SubTopicAccordion';
import aftermarket from '../img/aftermarket.jpg'
import  askbid from '../img/askbid.jpg'
import premarket from '../img/premarket.jpg'
import stock from '../img/stock.jpg'


const styles = {
    gridContainer: {
        padding: '20px',
        maxWidth: '100%',
        borderRadius: '20px', // Adds rounded corners to the image
    },
   
};

const TopicsPage = () => {
    const subTopics = [
        {
            description: 'מתרחש לאחר סגירת השוק, בדרך כלל משעה 16:00 (23:00 בלילה שעון ישראל ) עד 20:00 (3:00 שעון ישראל ) שעון מזרח. בדומה למסחר המוקדם, הוא מספק הזדמנות למשקיעים לסחור בחדשות או באירועים המתרחשים לאחר הפגישה הרגילה בשוק. מסחר במניות מחוץ לשעות הרגילות יכול להציע גמישות ונוחות, אבל זה מגיע גם עם סיכונים כמו נזילות נמוכה יותר ותנודתיות גבוהה יותר. המשמעות היא שייתכן שיהיו פחות קונים ומוכרים, מה שעלול להוביל לתנודות גדולות יותר במחיר.',
            imageUrl: aftermarket,
        },
        {
            description: 'מתרחש לאחר סגירת השוק, בדרך כלל משעה 16:00 (23:00 בלילה שעון ישראל ) עד 20:00 (3:00 שעון ישראל ) שעון מזרח. בדומה למסחר המוקדם, הוא מספק הזדמנות למשקיעים לסחור בחדשות או באירועים המתרחשים לאחר הפגישה הרגילה בשוק. מסחר במניות מחוץ לשעות הרגילות יכול להציע גמישות ונוחות, אבל זה מגיע גם עם סיכונים כמו נזילות נמוכה יותר ותנודתיות גבוהה יותר. המשמעות היא שייתכן שיהיו פחות קונים ומוכרים, מה שעלול להוביל לתנודות גדולות יותר במחיר.',
            imageUrl: askbid,
        },
        {
            description: 'זה מתרחש לפני פתיחת השוק הרגיל, בדרך כלל החל משעה 4:00 בבוקר ( 11:00 בבוקר שעון ישראל )  ונמשך עד פתיחת השוק בשעה 9:30 (16:30 שעון ישראל )  בבוקר שעון המזרח. המסחר המוקדם מאפשר למשקיעים להגיב לחדשות ואירועים, כמו דוחות רווחים או נתונים כלכליים, המתרחשים מחוץ לשעות המסחר הרגילות.',
            imageUrl: premarket,
        },
        {
            description: 'מתרחש לאחר סגירת השוק, בדרך כלל משעה 16:00 (23:00 בלילה שעון ישראל ) עד 20:00 (3:00 שעון ישראל ) שעון מזרח. בדומה למסחר המוקדם, הוא מספק הזדמנות למשקיעים לסחור בחדשות או באירועים המתרחשים לאחר הפגישה הרגילה בשוק. מסחר במניות מחוץ לשעות הרגילות יכול להציע גמישות ונוחות, אבל זה מגיע גם עם סיכונים כמו נזילות נמוכה יותר ותנודתיות גבוהה יותר. המשמעות היא שייתכן שיהיו פחות קונים ומוכרים, מה שעלול להוביל לתנודות גדולות יותר במחיר.',
            imageUrl: stock,
        },
        
    ];

    return (
        <Grid container style={styles.gridContainer} spacing={8}>
            {subTopics.map((subTopic, index) => (
                <Grid item xs={3} key={index}>
                    <SubTopicAccordion {...subTopic} />
                </Grid>
            ))}
        </Grid>
    );
};

export default TopicsPage;
