import React from 'react';
import aftermarket from '../img/aftermarket.jpg'
import  askbid from '../img/askbid.jpg'
import premarket from '../img/premarket.jpg'
import stock from '../img/stock.jpg'
import RowTopics from '../components/RowTopics';
import Carousel from '../components/Carousel'


const BasicConcept = () => {
    const subTopics = [
        {
            description: 'מתרחש לאחר סגירת השוק, בדרך כלל משעה 16:00 (23:00 בלילה שעון ישראל ) עד 20:00 (3:00 שעון ישראל ) שעון מזרח. בדומה למסחר המוקדם, הוא מספק הזדמנות למשקיעים לסחור בחדשות או באירועים המתרחשים לאחר הפגישה הרגילה בשוק. מסחר במניות מחוץ לשעות הרגילות יכול להציע גמישות ונוחות, אבל זה מגיע גם עם סיכונים כמו נזילות נמוכה יותר ותנודתיות גבוהה יותר. המשמעות היא שייתכן שיהיו פחות קונים ומוכרים, מה שעלול להוביל לתנודות גדולות יותר במחיר.',
            imageUrl: aftermarket,
        },
        {
            description:'המחיר של כל מניה משתנה בהתאם להיצע וביקוש. מחיר ה"היצע" מייצגת את המחיר שבו מוכנים מוכרי המניות למכור את מניותיהם, בעוד שה"ביקוש" מייצג את המחיר שבו קונים מוכנים לרכוש מניות. כאשר הביקוש על מניה  גבוה (כלומר, ישנם רבים המעוניינים לרכוש אותה), מחיר המניה עולה , מכיוון שקונים יהיו מוכנים לשלם יותר כדי להבטיח את רכישתה.  לעומת זאת, כאשר יש היצע גבוהה למניה (כלומר, ישנם רבים המעוניינים למכור אותה) והביקוש נמוך, מחיר המניה יכול לרדת מכיוון שמוכרים יציעו מחירים נמוכים יותר כדי למכור אותה. מנגנון זה של הצעה וביקוש הוא שמניע את דינמיקת המחירים בשוק המניות.',
            imageUrl: askbid,
        },
        {
            description: 'מתרחש לפני פתיחת השוק הרגיל, בדרך כלל החל משעה 4:00 בבוקר ( 11:00 בבוקר שעון ישראל )  ונמשך עד פתיחת השוק בשעה 9:30 (16:30 שעון ישראל )  בבוקר שעון המזרח. המסחר המוקדם מאפשר למשקיעים להגיב לחדשות ואירועים, כמו דוחות רווחים או נתונים כלכליים, המתרחשים מחוץ לשעות המסחר הרגילות.',
            imageUrl: premarket,
        },
        {
            description: 'מניה מייצגת בעלות בחברה. כאשר אתה קונה מניה, אתה רוכש חלק קטן מאותה חברה, המכונה "מניה". חברות מוכרות מניות כדי לגייס כסף למטרות שונות, כמו הרחבת העסק שלהן או פיתוח מוצרים חדשים. בעלות על מניות בחברה הופכת אותך לבעל מניות, כלומר יש לך תביעה על חלק מהנכסים והרווחים של החברה. ככל שבבעלותך יותר מניות, כך חלק החברה בבעלותך גדול יותר.',
            imageUrl: stock,
        },
        
    ];

    return (
        <div>
            {/* <Carousel /> */}
            <RowTopics subTopics ={subTopics}/>

            
        </div>
    );
};

export default BasicConcept;
