import React from 'react';
import Introduction from '../components/Introduction';
import '../Style/Psychology.css';
import RowTopics from '../components/RowTopics';
import how from '../img/DayTrade1.jpg'
import onWaht from '../img/DayTrade2.jpg'
import Find from '../img/DayTrade3.jpg'
import time from '../img/DayTrade4.jpg'
import TradeProsCons from '../components/TradeProsCons';



const DayTrade = () => {

    const subTopics1 = [
        {
            description:"מסחר יומי ניתן לבצע באמצעות כל מערכת מסחר,סוחר יומי יתן דגש על מערכת מסחר מקצועית ומהירה שתדע לשרת את הצרכים שלו במסחר.לרוב נהוג לבצע Day Trading דרך מחשב נייח או נייד כאשר הסוחר זמין וקשוב בצורה מלאה למסחר ללא הסחות דעת.מסחר יומי זה לגמרי דבר שאפשרי לביצוע גם באמצעות פלאפון אך זה פחות מומלץ עבור סוחר מקצועי.",
            imageUrl: how,
        },
        {
            description : 'סוחרים יומיים בדרך כלל אוהבים נכסים עם נזילות גבוהה מאוד – כאלה שקל לקנות ולמכור במהירות, כמו מניות בבורסה האמריקאית, מט"ח, מטבעות קריפטו מובילים, וסחורות. אבל אפשר גם לסחור יומי על נכסים עם נזילות קצת פחות גבוהה, כמו מניות בבורסה הישראלית. פשוט צריך לשים לב ל-Spread, עמלות המסחר ודברים נוספים שעלולים להשפיע על הצלחת המסחר היומי שלך.',
            imageUrl: onWaht,
        },
        {
            description : 'קל למצוא מניות למסחר יומי בעזרת סורק מניות. פשוט תגדירו את הפרמטרים שאתם מחפשים, והוא יריץ בדיקה מהירה על כל הבורסה האמריקאית. אחרי שתמצאו מניות מתאימות, בדקו לעומק שהן תואמות את אסטרטגיית המסחר שלכם. סוחרים יומיים רבים מחפשים מניות עם נפח מסחר גבוה בפרה מרקט, תנועה חריגה, או Short Float גבוה. יש הרבה אסטרטגיות למסחר יומי שאפשר ללמוד בצורה מקצועית בקורס המסחר היומי שלנו.',
            imageUrl: Find,
        },
        {
            description : 'כדי לסחור יומי לא צריך להשקיע המון זמן. יש אפילו כאלה שיגידו שכדאי להגביל את הזמן והכמות של העסקאות ביום. המינימום הנדרש הוא שעה הכנה לפני פתיחת המסחר ושעה מסחר בפועל. סוחרים יומיים בדרך כלל סוחרים בבורסה האמריקאית בין 16:30 ל-17:30, כשיש הכי הרבה אקשן ותנודתיות. בסופו של דבר, רוב הסוחרים היומיים יפנו את הזמן שלהם בין 15:30 ל-17:30 למסחר בבורסה האמריקאית.',
            imageUrl: time,
        },
    ];

    const title = 'הרפתקת המסחר היומי';
    const text = 'מסחר יומי הוא כמו הרפתקה יומית בשוק ההון – כל יום מביא איתו הזדמנויות חדשות וריגושים חדשים. במסחר יומי, קונים ומוכרים מניות תוך יום אחד במטרה לנצל שינויים מהירים במחירים. זהו סוג של מסחר שמתאים למי שמחפש ריגושים מהירים ורווחים מהירים. מסחר יומי דורש תשומת לב רבה, מהירות ויכולת קבלת החלטות מהירה. אז אם אתה אוהב את הקצב המהיר של השוק ומחפש את האתגר, מסחר יומי יכול להיות בדיוק מה שאתה מחפש!';

    return (
        <div>
            <Introduction title={title} text={text} />
            <RowTopics subTopics={subTopics1} />
            <TradeProsCons/>

        </div>
    );
};

export default DayTrade;
