import React from 'react';
import Introduction from '../components/Introduction';
import '../Style/Psychology.css'
import RowTopics from '../components/RowTopics';
import FundamentalAnalysisCarousel from '../components/FundamentalAnalysisCarousel';
import MessageList from '../components/MessageList ';


import doublebottom from '../img/doublebottom.jpg'
import BoolPennant from '../img/BoolPennant.jpg'
import CupHandle from '../img/CupHandle.jpg'
import BoolStake from '../img/BoolStake.jpg'
import HeadSholders from '../img/HeadSholders.jpg'
import BoolFlag from '../img/BoolFlag.jpg'
import BoolStake2 from '../img/BoolStake2.jpg'
import TripleButtom from '../img/TripleButtom.jpg'

const LongTerm = () => {
    const subTopics1 = [
        {
            description: "התבנית הזו נראית כמו האות W והיא סימן טוב לכך שהמניה יכולה להתחיל לעלות לאחר שהגיעה לשתי נקודות תחתית דומות. המניה נבדקת פעמיים על ידי המשקיעים כדי לראות אם היא הגיעה לתחתית אמיתית. לאחר שלא מצליחים לשבור את התמיכה פעמיים, המשקיעים מקבלים ביטחון שהמחיר הגיע לנקודת תחתית ומתחילים לקנות, מה שמוביל לעלייה.",
            imageUrl: doublebottom,
        },
        {
            description: "התבנית הזו נראית כמו דגל קטן אחרי תורן עלייה חד. דגלון שורי מתרחש כאשר יש עלייה חדה במחיר, ולאחריה תקופה קצרה של התייצבות או תיקון קל. ההיגיון הוא שהשוק לוקח הפסקה קטנה אחרי עלייה חדה לפני שהוא ממשיך במגמה הכללית. הדגלון מסמל עצירה קלה לפני שהמחיר ממשיך לעלות.",
            imageUrl: BoolPennant,
        },
        {
            description: "תבנית זו נראית כמו ספל עם ידית. המחיר עולה, עובר שלב של ירידה קלה (הספל), ואז ממשיך לעלות (הידית). ההיגיון הוא שבמהלך הספל, המשקיעים לוקחים רווחים ומבצעים מכירות קלות. כאשר המחיר מתייצב ונוצר הידית, ישנה התארגנות מחדש של המשקיעים לקראת המשך עלייה.",
            imageUrl: CupHandle,
        },
        {
            description: "תבנית שנראית כמו יתד הננעצת באדמה, כאשר המחיר יורד בצורה חדה ואז מתייצב. תבנית זו מסמלת שהמניה עומדת להפוך כיוון ולהתחיל לעלות. הירידה החדה מייצרת פאניקה ומכירות יתר, ולאחר מכן מגיעים קונים שמזהים את המחיר כנמוך מדי ומתחילים לקנות, מה שגורם להתייצבות ולאחר מכן לעלייה.",
            imageUrl: BoolStake,
        },
    ];

    const subTopics2 = [
        {
            description: "תבנית שנראית כמו ראש עם שתי כתפיים, אבל הפוך. זוהי תבנית חזקה שמסמנת שינוי מגמה כלפי מעלה לאחר תקופה של ירידות. בתחילה יש ירידה חזקה (הכתף הראשונה), לאחר מכן עלייה קטנה (הראש), ואז ירידה נוספת שלא מצליחה לשבור את התחתית הקודמת (הכתף השנייה). זה מראה שמשקיעים אינם מוכנים למכור מתחת למחירים הנמוכים שהיו קודם לכן, ומתחילים לקנות מחדש.",
            imageUrl: HeadSholders,
        },
        {
            description: "תבנית דומה לדגלון שורי, אבל ארוכה יותר. המחיר עולה בצורה חדה, עובר תקופה של ירידה קלה (הדגל), ואז ממשיך לעלות. זה כמו שהמניה לוקחת חופש קצר לפני שהיא ממשיכה לטפס. התיקון הקל במהלך הדגל נותן לשוק זמן לעכל את העלייה לפני שהוא ממשיך במגמה הראשית.",
            imageUrl: BoolFlag,
        },
        {
            description: "תבנית נוספת של יתד שורי שמסמנת שהמחיר מתייצב לפני שהוא ממשיך לעלות. הירידה החדה מייצרת פאניקה ומכירות יתר, ולאחר מכן מגיעים קונים שמזהים את המחיר כנמוך מדי ומתחילים לקנות, מה שגורם להתייצבות ולאחר מכן לעלייה.",
            imageUrl: BoolStake2,
        },
        {
            description: "תבנית שבה המחיר מגיע לשלוש נקודות תחתית דומות לפני שהוא מתחיל לעלות. המחיר נבדק שלוש פעמים על ידי המשקיעים כדי לראות אם הוא הגיע לתחתית אמיתית. לאחר שלא מצליחים לשבור את התמיכה שלוש פעמים, המשקיעים מקבלים ביטחון שהמחיר הגיע לנקודת תחתית ומתחילים לקנות, מה שמוביל לעלייה.",
            imageUrl: TripleButtom,
        },
    ];

    const title = 'רכיבה על גלי ההשקעה לטווח הארוך'
    const text = 'מסחר לונג הוא כמו רכיבה על גל בגלישה – אתה עולה על הגל ומתכוון לרכוב עליו כמה שיותר רחוק. בניגוד למסחר יומי, שבו כל קנייה ומכירה מתבצעת בתוך יום אחד, מסחר לונג משקף השקעה בטווח הארוך יותר. כאן אתה קונה מניות מתוך אמונה שהן יעלו בערכן לאורך זמן – זה יכול להיות ימים, שבועות, חודשים ואפילו שנים! המטרה שלך היא לזהות חברות עם פוטנציאל צמיחה וליהנות מהרווחים כשהן גדלות. אז חגור את החגורה, ותרכוב על הגלים של שוק ההון עם מסחר לונג – זה יכול להיות מסע מרתק ומתגמל!'
    const title2 = 'תבניות לניתוח טכני למסחר ארוך טווח'
    const text2 = "תבניות לניתוח טכני הן כמו מפת אוצר עבור סוחרי מניות, עוזרות לזהות את הכיוון של השוק ואת הזדמנויות המסחר הטובות ביותר. במסחר לטווח ארוך, תבניות אלו מאפשרות לסוחרים להבין את המגמות בשוק ולהשקיע בחוכמה. אם תוכל לקרוא את המפה הזו נכון, תוכל לרכוב על גלי ההשקעה הארוכים ולהפיק מהם את המקסימום. אז קדימה, הכן את המפה שלך וצא למסע המרתק בשוק ההון עם תבניות הניתוח הטכני!"
    const title3 = 'מהו ניתוח פונדומנטלי?';
    const text3 = 'ניתוח פונדומנטלי הוא כלי חשוב למשקיעים שרוצים להבין את הבריאות הכלכלית של חברה ואת הפוטנציאל שלה לצמיחה עתידית. זהו תהליך שמבוסס על בחינת הנתונים הפיננסיים של החברה, כמו דוחות כספיים, יחס נכסים לעומת התחייבויות, וצמיחת רווחים. בעזרת ניתוח פונדומנטלי, משקיעים יכולים לקבל תמונה ברורה יותר של המצב הנוכחי של החברה ולחזות את ביצועיה העתידיים, ובכך לקבל החלטות השקעה מושכלות יותר.';

    return (
        <div>
            <Introduction title={title} text={text} />

            <div className="transparent-background">
                <Introduction title={title2} text={text2} />
                <RowTopics subTopics={subTopics1} />
                <RowTopics subTopics={subTopics2} />
            </div>

            <Introduction title = {title3} text ={text3} />
            <FundamentalAnalysisCarousel />
            
            
         
        </div>
    );
};

export default LongTerm;
