import React from 'react';
import '../Style/Psychology.css'
import ImageTextDisplay from '../components/ImageTextDisplay ';
import man from '../img/man think.jpg'
import Introduction from '../components/Introduction';
const Psychology = () => {

    const title = 'הפסיכולוגיה של שוק ההון'
    const imgTextDisplay = {  title: "פסיכולוגיית מסחר ולמה זה כל כך חשוב?", content_text: "תארו לעצמכם שאתם עומדים בתוך קרנבל גדול של החלטות כלכליות, כאשר כל משחק ודוכן הם הזדמנויות לרכישה ומכירה. פסיכולוגיית המסחר היא המדריך האישי שלכם בקרנבל הזה, עוזר לכם להבין מדוע לפעמים אנו נסחפים אחרי המתוקים ומתקשים לעזוב את המשחקים המסוכנים, אף על פי שהם עלולים להוביל להפסדים. זהו תחום שמלמד אותנו איך לזהות את הרגשות הבוערים שמאחורי כל החלטה, מהפחד מלרדת מהגלגל הענק עד להתרגשות מהזכייה בדוכן היריות.ככל שנבין טוב יותר את האופן שבו הרגשות והתפיסות שלנו משפיעות עלינו, כך נוכל לשפר את יכולתנו לנווט בקרנבל הפיננסי בחוכמה רבה יותר, להימנע מהמלכודות ולזכות בפרסים הגדולים." }
    const text = 'כשמדובר בשוק ההון, לא רק מספרים ונתונים קובעים את המשחק - הרגשות שלנו משחקים תפקיד ענק.מדוע אנחנו מתלהבים ממניה ש"כולם קונים" או מהרדים מלהשקיע כשהשוק יורד? זה כל הקסם (והאתגר) של הפסיכולוגיה בשוק ההון. בואו נצלול יחד לעולם הזה ונלמד איך להכיר את הרגשות שלנו, להבין אותם ואולי אפילו להשתמש בהם לטובתנו.'
    return (
        <div>



            <Introduction text = {text} title ={title}/>
            <ImageTextDisplay obj={imgTextDisplay} img={man} />



        </div>
    );
};

export default Psychology;
