import React from 'react';
import '../Style/Psychology.css'
import ImageTextDisplay from '../components/ImageTextDisplay ';
import man from '../img/man think.jpg'
import Introduction from '../components/Introduction';
import Fear from '../img/Fear.webp'
import Optimism from '../img/Optimism.webp'
import Grid from '../img/Grid.webp'
import Fomo from '../img/Fomo.webp'
import RowTopics from '../components/RowTopics';
import { Typography } from '@mui/material';
import Avoid from '../img/avoid.png'



const Psychology = () => {
    const subTopics1 = [
        {
            description:"החשש מהפסדים זה כמו זה שמרגישים לפני קפיצה מגשר באנג'י. הלב דופק, הכפות ידיים מתחילות להזיע, והרגליים רועדות. בשוק ההון, החשש הזה יכול לגרום למשקיעים למכור את המניות שלהם במחיר נמוך מדי, רק כדי 'להימלט' מההפסד האפשרי. זה נקרא 'חיתוך הפסדים' אבל לפעמים זה יותר דומה ל'חיתוך הרווחים'.",
            imageUrl: Fear,
        },
        {

            description : 'להיות אופטימי זה נהדר, אבל בשוק ההון, אופטימיות יתר יכולה להיות כמו לרכב על רולרקוסטר עם עיניים עצומות - אתה יכול להנות מהנסיעה, אבל אתה גם עלול לפספס את הרגעים שבהם צריך להחליט מתי לעלות ומתי לרדת. אופטימיות יתר עלולה להוביל משקיעים להתעלם מאותות אזהרה ולהמשיך להשקיע במניות שהן לא בהכרח ההחלטה הכי טובה.', 
            imageUrl : Optimism,
        },
        {
            description: 'כולנו רוצים להרוויח, אבל לפעמים התיאבון לרווח יכול לעוור אותנו. זה כמו לאכול את כל השוקולדים בקופסא בבת אחת, ואז לתהות למה אנחנו מרגישים רע. במסחר, תיאבון זה יכול להוביל לקניות רשלניות או להחזיק במניות יותר מדי זמן בתקווה לרווחים גדולים יותר, גם כשכל הסימנים אומרים למכור.',
            imageUrl: Grid,
        },
        {
            description: 'טמעון זה כשאתה בטוח שהגרלה שלך תזכה כי "הפעם הרגשתי את זה!" גם בשוק ההון, אנחנו לפעמים נוטים להאמין שההשקעה שלנו תהיה הזוכה הגדולה הבאה, אפילו אם הסיכונים גבוהים מדי. זה כמו לשים את כל הקליפות בסל אחד, ואז לתהות למה הסל מתחיל לרעוד.',
            imageUrl: Fomo,
        },
        
    ];
    const title = 'הפסיכולוגיה של שוק ההון'
    const imgTextDisplay = {  title: "פסיכולוגיית מסחר ולמה זה כל כך חשוב?", content_text: "תארו לעצמכם שאתם עומדים בתוך קרנבל גדול של החלטות כלכליות, כאשר כל משחק ודוכן הם הזדמנויות לרכישה ומכירה. פסיכולוגיית המסחר היא המדריך האישי שלכם בקרנבל הזה, עוזר לכם להבין מדוע לפעמים אנו נסחפים אחרי המתוקים ומתקשים לעזוב את המשחקים המסוכנים, אף על פי שהם עלולים להוביל להפסדים. זהו תחום שמלמד אותנו איך לזהות את הרגשות הבוערים שמאחורי כל החלטה, מהפחד מלרדת מהגלגל הענק עד להתרגשות מהזכייה בדוכן היריות.ככל שנבין טוב יותר את האופן שבו הרגשות והתפיסות שלנו משפיעות עלינו, כך נוכל לשפר את יכולתנו לנווט בקרנבל הפיננסי בחוכמה רבה יותר, להימנע מהמלכודות ולזכות בפרסים הגדולים." }
    const text = 'כשמדובר בשוק ההון, לא רק מספרים ונתונים קובעים את המשחק - הרגשות שלנו משחקים תפקיד ענק.מדוע אנחנו מתלהבים ממניה ש"כולם קונים" או מהרדים מלהשקיע כשהשוק יורד? זה כל הקסם (והאתגר) של הפסיכולוגיה בשוק ההון. בואו נצלול יחד לעולם הזה ונלמד איך להכיר את הרגשות שלנו, להבין אותם ואולי אפילו להשתמש בהם לטובתנו.'
    const imgTextDisplay2 = {  title: "להימנע מרגשות מיותרים בשוק ההון", content_text: "אז בואו נדבר על שוק ההון - זהו מקום קסום שבו העליות יכולות להיות מסחררות כמו נסיעה ברכבת הרים, והירידות יכולות להיות תחושה פחות נעימה, כמו מציאת זית במרכז גלידת וניל. אז איך אתה שורד את הסערה בלי להפסיד את הכיף? קודם כל, נזכר לשים את החגורה באמצעות תוכנית השקעות חזקה וברורה, שתשמש כמעין מפתח השליטה שלך לטיול. כשהגלים גבוהים והרוח נושבת, אנחנו לא צופים רק בנוף המתהפך, אלא מתמקדים ביעד הסופי . זה הזמן להסתכל רחוק יותר מהטלטלות היום-יומיות ולחשוב על אותם יעדים ארוכי טווח שקבענו, כמו להשקיע בחלומות שלנו או להגשים את התוכנית להגשמת החלומות. ומה עם הסיכונים? כמו בכל טיול טוב, חשוב להפציר גיוון - לא רק בפארק שעשועים אלא גם בפורטפוליו ההשקעות שלך. מה זה בעצם גיוון? זה כמו לקחת גלידה בכל הטעמים ולא רק וניל, כך שאם מצאת זית בגלידה אחת, לפחות יש לך עוד כמה גביעים ליהנות מהם. וכשהתרגשות מרבה, זה הזמן להוציא את עצמך מהתמונה להפסקה קטנה. התרחק ממסך המחשב, קח נשימה עמוקה, ותזכור שלעתים זה רק סיבוב אחד במסלול ארוך של הרפתקאות ההשקעה. בסופו של יום, התמונה המרהיבה לצידך אינה רק עוד ציור - היא סמל לאותה השלווה ואיזון רגשי שאנחנו כולנו שואפים להם בעולם הסוער והמרתק של השוק ההון. " }

    return (
        <div >

            <div style={{margin : '50px'}}>
            <Introduction text = {text} title ={title}/>


            </div>
            <ImageTextDisplay obj={imgTextDisplay} img={man} />
            <div style={{ textAlign: 'center' }} >
            <Typography style={{  color:'white' , backgroundColor :'black' , borderRadius :'20px', padding :'15px' ,  display: 'inline-block'}} variant='h3'>?אז מה מרגישים בשוק ההון</Typography>
            <RowTopics subTopics ={subTopics1}/>
            </div>
            <div className="img-wrapper">
            <ImageTextDisplay obj={imgTextDisplay2} img={Avoid} />
            </div>



            {/* <div style={{ textAlign: 'center' }} >
            <Typography style={{  color:'white' , backgroundColor :'black' , borderRadius :'20px', padding :'15px' ,  display: 'inline-block'}} variant='h3'>?אז מה צריך לעשות</Typography>
            <RowTopics subTopics ={subTopics1}/>
            </div> */}






        </div>
    );
};

export default Psychology;
