import React from 'react';
import israel from '../img/israel.jpg'
import tokyo from '../img/tokyo.jpg'
import nasdaq from '../img/nasdaq.jpg'
import newyork from '../img/newyork.jpg'
import bafet from '../img/bafet.png'
import ImageTextDisplay from '../components/ImageTextDisplay ';


import RowTopics from '../components/RowTopics';


const StockExchange = () => {
    const subTopics1 = [
        {
            description: 'בורסת ישראל היא הבורסה הרשמית במדינת ישראל. שעות פתיחת הבורסה הרשמיות הן: 9:45-16:30 בימי ראשון-חמישי (ישנם ימי שוק שבהם הבורסה נפתחת ב9:30 . ) מטבע המסחר הראשי בבורסה הוא- שקל חדש. חשוב לדעת - כשאנחנו מסתכלים על המחיר המוצג של מנייה בישראל הוא מוצג באגורות ולכן על מנת להבין את מחירו - נצטרך לחלק במאה.',
            imageUrl: israel,
        },
        {
            description:'בורסת טוקיו משמשת כמרכז פיננסי ובעלת השפעה גדולה על הכלכלה של יפן ועל המסחר העולמי. שעות הפעילות הן 9:00-15:00 שעון יפן וישנם ימי שוק שבם נפתחת ונסגרת קודם.המניות בבורסת טוקיו מתחלקות לקבוצות: מניות ראשיות, אירופיות וכדומה .בגלל השפעתה הגדולה על המסחר העולמי ועל הכלכלה העולמית היא נחשבת לאחת הבורסות המשפיעות על אסיה ועל העולם , היא נסחרת במטבע ה-ין היפני, שהוא המטבע המקומי ביפן.',
            imageUrl: tokyo,
        },
        {
            description: 'בורסת נאסק גם היא אחת מהבורסות הבולטות ביותר וממוקמת בניו יורק.  השם נאסד״ק הוא ראשי תיבות באנגלית של שוק הערכות ואופציות בבורסה. שעות הפעילות 9:30-16:00 שעון ארה״ב קיימות גם שעות מסחר מוקדמות ומאוחרות.  המטבע בו נסחרת היא הדולר האמריקאי. נאסד״ק מכילה בתוכה חברות גדולות ורבות כמו: גוגל, אפל, אמזון, פייסבוק, ועוד.נאסד״ק הוא שוק מסחר אלקטרוני וחלק מהמדדים העיקרים שלו הם: Nasdaq 100 , המדד הזה מייצג את התנועות בשוק כולו או בתחום של תעשיה ספציפית.',
            imageUrl: nasdaq,
        },
        {
            description: 'בורסת ניו יורק היא אחת מהבורסות הבולטות והחשובות היא ממוקמת בלה מהנטן. שעות הפעילות של הבורסה היא 9:30-16:00 שעון ארה״ב. בשעות הערב לאחר הסגירה יש שעות מסחר מאוחרות. המטבע בו נסחרת היא דולר אמריקאי, בורסת ארה״ב מציעה מגוון של מדדים ובניהם המדד המוכר ביותר Djnc וגם S&p 500 המורכב מ30 מניות מובילות בשוק. מדדים עיקרים אלו מסייעים להבנת השוק הם מייצגות אירועים כלכלים גדולים, פיתוחים טכנולוגים וגאוגרפיים ועלולים להשפיע על הבורסה כולה.',
            imageUrl: newyork,
        },
        
    ];

   
  
    const imgTextDisplay = { url : 'https://www.youtube.com/watch?v=ruwoQA-jgaQ&t=694s' , title : "וורן באפט" , content_text :'וורן באפט, מוכר גם כ"אורקל מאומהה", הוא אחד מהמשקיעים המצליחים והמוערכים בעולם. ידוע בגישת השקעה ערכית וארוכת טווח, באפט הפך למיליארדר בהודות לאסטרטגיות שקעה זהירה ומחקר יסודי. הוא מנהל את חברת Berkshire Hathaway, שבבעלותה מגוון עסקים ומניות בחברות מובילות. באפט גם ידוע בפילנתרופיה נרחבת, כאשר התחייב לתרום רוב הונו לצדקה.'}



    return (
        <div>
            {/* <Carousel /> */}
            <RowTopics subTopics ={subTopics1}/>
             <ImageTextDisplay obj = {imgTextDisplay} img = {bafet}/>
            
        </div>
    );
};

export default StockExchange;
