import React from 'react';
import Interactive from '../img/Interactive.jpg'
import investing from '../img/investing.jpg'
import etoro from '../img/etoro.jpg'
import  tradingview from '../img/tradingview.jpg'
import premarket from '../img/tradingview.jpg'
import stock from '../img/stock.jpg'
import earnmoney from '../img/earnmoney.jpg'
import dividend from '../img/dividend.png'
import gap from '../img/gap.png'
import volume from '../img/volume.png'
import ImageTextDisplay from '../components/ImageTextDisplay ';
import candels from '../img/candels.jpg';
import israel from '../img/israel.jpg'
import tokyo from '../img/tokyo.jpg'
import nasdaq from '../img/nasdaq.jpg'
import newyork from '../img/newyork.jpg'
import Advantages from '../components/Advantages';
import RowTopics from '../components/RowTopics';
import Introduction from '../components/Introduction';
import '../Style/Psychology.css'
import '../Style/trading.css';

const TechnologicalTools = () => {
    const subTopics1 = [
        {
            description: 'אתר זה מאפשר לנו לצפות בתיקי השקעות של לקוחות ואנליסטים מוכרים ובכך להעתיק ולחקות את התנועות שלהם',
            imageUrl: etoro,
        },
        {
            description:'אפליקציה זאת תשמש אותנו למעקב אחרי המניות, מאפשרת צפייה בזמן אמת במחירי המניות ללא עלות, גישה לגרפים של המניות והצגת נתונים פיננסים.',
            imageUrl: investing,
        },
        {
            description: 'אפליקציה זאת משמשת אותנו למסחר, בה נפקיד את הכסף, נבצע פעולות: קנייה,ומכירה.',
            imageUrl: Interactive,
        },
        {
            description: 'אתר שמשמש לניתוח גרפי, האתר מספק לנו אפשרות לשרטט על הגרף להעביר קווים כמו: קווי מדמה,לסמן נקודות קריטיות על הגרף.',
            imageUrl: tradingview,
        },
        
    ];

    const subTopics2 = [
        {
            description: 'השקעה במניות יכולה להיות דרך להרוויח כסף, בין אם קנינו את המניה ומחירה עולה ובין אם מכרנו את המניה ומכירה יורד . דרך נוספת להרוויח היא באמצעות דיבידנדים, שהם תשלומים שחברות מסוימות משלמות לבעלי המניות מתוך הרווחים שלהן כאשר הם קונים את המניה .',
            imageUrl: earnmoney,
        },
        {

            description : 'במסחר במניות, גאפ מתייחס להפרש מחירים מורגש בין סגירת יום מסחר אחד לפתיחה של יום מסחר אחר, ללא מסחר ביניהם. גאפים  מתרחשים בדרך כלל עקב אירועים משמעותיים או חדשות המשפיעות על סנטימנט המשקיעים לגבי מניה, מה שיכול לקרות לאחר סגירת השוק או לפני פתיחתה. ישנם סוגים שונים של גאפים ,גאפ הפ ( מחיר המניה גבוה מיום לפני ) וגאפ דאון ( מחיר המניה נמוך מיום לפני )  כל אחד מעיד על סנטימנטים שונים בשוק ועל תנועות מחיר עתידיות פוטנציאליות. גאפים חשובים בניתוח טכני מכיוון שהם יכולים לספק תובנות לגבי מגמות שוק והתנהגות משקיעים.', 
            imageUrl : gap,
        },
        {
            description: 'דיבידנד הוא תשלום שמעבירה החברה לבעלי המניות שלה, בדרך כלל מרווחים שנצברו בה או מעודפים כספיים. במילים אחרות  זו היא הדרך של החברה לשתף את הרווחים עם בעליה - כאשר החברה מייצרת רווחים היא יכולה לשלם חלק מהם לבעלי המניות כדיבידנד ולשמור את היתרה לשימושה. בדרך כלל החברה מודיעה על תאריך בוא היא הולכת לחלק דיבידנדים ובתאריך הזה כל שותף במניות מקבל סכום של כסף לפי מספר המניות שלו. ',
            imageUrl: dividend,
        },
        {
            description: 'בשוק המניות, נפח מתייחס למספר המניות של מניה מסוימת הנסחרות בתוך תקופה מסוימת, בדרך כלל יום מסחר בודד. נפח מסחר גבוה מעיד על רמת עניין גבוהה במניה, שיכולה לנבוע מגורמים שונים כמו חדשות על המניה , דוחות כלכליים או מגמות בשוק. נפח הוא אינדיקטור מרכזי בניתוח טכני, מכיוון שהוא עוזר למשקיעים לאמוד את החוזק של תנועת מחירים וסנטימנט המשקיעים הפוטנציאלי.',
            imageUrl: volume,
        },
        
    ];

    const subTopics3 = [
        {
            description: 'בורסת ישראל היא הבורסה הרשמית במדינת ישראל. שעות פתיחת הבורסה הרשמיות הן: 9:45-16:30 בימי ראשון-חמישי (ישנם ימי שוק שבהם הבורסה נפתחת ב9:30 . ) מטבע המסחר הראשי בבורסה הוא- שקל חדש. חשוב לדעת - כשאנחנו מסתכלים על המחיר המוצג של מנייה בישראל הוא מוצג באגורות ולכן על מנת להבין את מחירו - נצטרך לחלק במאה.',
            imageUrl: israel,
        },
        {
            description:'בורסת טוקיו משמשת כמרכז פיננסי ובעלת השפעה גדולה על הכלכלה של יפן ועל המסחר העולמי. שעות הפעילות הן 9:00-15:00 שעון יפן וישנם ימי שוק שבם נפתחת ונסגרת קודם.המניות בבורסת טוקיו מתחלקות לקבוצות: מניות ראשיות, אירופיות וכדומה .בגלל השפעתה הגדולה על המסחר העולמי ועל הכלכלה העולמית היא נחשבת לאחת הבורסות המשפיעות על אסיה ועל העולם , היא נסחרת במטבע ה-ין היפני, שהוא המטבע המקומי ביפן.',
            imageUrl: tokyo,
        },
        {
            description: 'בורסת נאסק גם היא אחת מהבורסות הבולטות ביותר וממוקמת בניו יורק.  השם נאסד״ק הוא ראשי תיבות באנגלית של שוק הערכות ואופציות בבורסה. שעות הפעילות 9:30-16:00 שעון ארה״ב קיימות גם שעות מסחר מוקדמות ומאוחרות.  המטבע בו נסחרת היא הדולר האמריקאי. נאסד״ק מכילה בתוכה חברות גדולות ורבות כמו: גוגל, אפל, אמזון, פייסבוק, ועוד.נאסד״ק הוא שוק מסחר אלקטרוני וחלק מהמדדים העיקרים שלו הם: Nasdaq 100 , המדד הזה מייצג את התנועות בשוק כולו או בתחום של תעשיה ספציפית.',
            imageUrl: nasdaq,
        },
        {
            description: 'בורסת ניו יורק היא אחת מהבורסות הבולטות והחשובות היא ממוקמת בלה מהנטן. שעות הפעילות של הבורסה היא 9:30-16:00 שעון ארה״ב. בשעות הערב לאחר הסגירה יש שעות מסחר מאוחרות. המטבע בו נסחרת היא דולר אמריקאי, בורסת ארה״ב מציעה מגוון של מדדים ובניהם המדד המוכר ביותר Djnc וגם S&p 500 המורכב מ30 מניות מובילות בשוק. מדדים עיקרים אלו מסייעים להבנת השוק הם מייצגות אירועים כלכלים גדולים, פיתוחים טכנולוגים וגאוגרפיים ועלולים להשפיע על הבורסה כולה.',
            imageUrl: newyork,
        },
        
    ];

    const orders = [
        {
          title: "Market",
          description: "פקודת שוק שמתבצעת מיידית במחיר השוק הנוכחי.",
          advantages: "מבטיחה ביצוע מיידי.",
          disadvantages: "המחיר יכול להיות בלתי צפוי, במיוחד בשוק עם תנודתיות גבוהה."
        },
        {
          title: " Limit",
          description: "פקודה לקנות או למכור נכס במחיר מוגדר מראש או טוב ממנו.",
          advantages: "מאפשרת שליטה במחיר הביצוע.",
          disadvantages: "אין הבטחה שהפקודה תתבצע אם השוק לא יגיע למחיר המוגדר."
        },
        {
          title: " Stop",
          description: "פקודה שהופכת לפקודת שוק כאשר מחיר השוק מגיע למחיר העצירה המוגדר.",
          advantages: "מאפשרת הגנה מפני הפסדים או נעילת רווחים.",
          disadvantages: "יכולת הביצוע תלויה בתנודתיות השוק והמחיר יכול להיות בלתי צפוי."
        },
        {
          title: " Stop Limit",
          description: "פקודה שמשלבת פקודת Stop ו-Limit. הפקודה הופכת לפקודת Limit כאשר מחיר השוק מגיע למחיר העצירה.",
          advantages: "מאפשרת שליטה במחיר הביצוע לאחר שהמחיר עבר את מחיר העצירה.",
          disadvantages: "אין הבטחה שהפקודה תתבצע אם השוק לא יגיע למחיר ה-Limit המוגדר."
        },
        {
          title: "פקודת Trailing Stop",
          description: "פקודה עצירה שנעה עם מחיר השוק. מחושב יחס אחוזי או ערך קבוע ממחיר השוק הנוכחי.",
          advantages: "מאפשרת נעילת רווחים תוך כדי תנועה עם השוק.",
          disadvantages: "במקרים של תנודתיות גבוהה, הפקודה יכולה להתבצע במחיר פחות אופטימלי."
        },
        
      ];
      
      const TradingOrders = () => {
        return (
          <div className="orders-container">
            {orders.map((order, index) => (
              <div key={index} className="order-card">
                <h3>{order.title}</h3>
                <p><strong>תיאור:</strong> {order.description}</p>
                <p><strong>יתרונות:</strong> {order.advantages}</p>
                <p><strong>חסרונות:</strong> {order.disadvantages}</p>
              </div>
            ))}
          </div>
        );
      };









    const imgTextDisplay = { url : 'https://www.youtube.com/watch?v=ruwoQA-jgaQ&t=694s' , title :  "נרות יפניים" , content_text : "נרות יפניים אחד הכלים הפופולרים לניתוח טכני . הם מספקים ייצוג חזותי של תנועות המחירים בתוך מסגרת זמן מסוימת.כל פמוט מציג ארבע פיסות מידע מרכזיות. הגוף הראשי (החלק הרחב יותר) של הפמוט מציג את מחירי הפתיחה והסגירה. אם מחיר הסגירה גבוה ממחיר הפתיחה, הפמוט נצבע לרוב בירוק, מה שמעיד על עלייה. אם מחיר הסגירה נמוך יותר, הפמוט בצבע אדום, מה שמצביע על ירידה.הקווים הנמשכים מהחלק העליון והתחתון של הגוף, מייצגים את המחירים הגבוהים והנמוכים במהלך התקופה."}

    const title = ' כלים למסחר'
    const text = 'בפרק זה נתמקד באתרים , אפליקציות  שיכולות לסייע בקנייה וניתוח במסחר, נבין את הצורך של כל תוכנת מסחר במה נבדלות ובמה זהות. כמו כן נלמד על פקודות מסחר שיוכלו לסייע  לנו להגביל ולשלוט על ההפסדים ולקיחת רווחים '
    return (
        <div>
            {/* <Carousel /> */}
            
            <Introduction title = {title} text = {text}/> 
            <RowTopics subTopics ={subTopics1}/>
            <h1>פקודות מסחר</h1>
            <TradingOrders />

            

            
        </div>
    );
};

export default TechnologicalTools;
